[
  {
    "zip": "75035",
    "city": "Frisco",
    "isd": "Frisco ISD",
    "medianHomePrice": 620000,
    "medianSalePrice": 615000,
    "rentMedian": 2800,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 95,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 1,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.2,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 35,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Frisco Parks Dept"],
    "localExplanation": "75035 is \"suburban ambition\" in zip-code form — new rooftops, new schools, new Costco, new playgrounds, new everything. It's the DFW landing zone for families who want the *Texas dream with the California finish.* Saturday mornings feel like a youth-sports Olympics: soccer at Bacchus, baseball at Warren, swim meets somewhere. Kids everywhere. Teslas everywhere. Chick-fil-A lines like they're giving away scholarships.\n\nThis pocket is tech-employed, stroller-heavy, double-income energy. PTA meetings feel like mini strategy sessions. But it's friendly — neighbors actually wave, kids run freely, and everyone knows at least one family who moved here from the Bay or SoCal.\n\nFrisco ISD here is \"achievement but reasonable.\" Parents are involved but not cutthroat. Robotics? Packed. Band? Serious. Sports? Elite. And everyone is tracking something — test scores, practice schedules, the best piano teachers — but the vibe stays supportive, not psycho.\n\nHomes are mostly 2010s-onward, with that \"model home\" polish. Front lawns are manicured like Instagram accounts. Houses are closer together than older suburbs, but neighborhoods feel alive and family-centric.\n\nYou live between 121, Stonebriar, The Star, and more youth sports complexes than seems mathematically possible. Convenience is the brand here.\n\nIf you want a suburb that's clean, new, high-performing, and buzzing with family activity, 75035 is your place. If you want big trees and quiet nights, this ain't that.",
    "restaurantUniqueCount": 45,
    "restaurantDiversityIndex": 0.75,
    "entertainmentCount": 12,
    "convenienceClusterScore": 85,
    "hasTownCenter": false,
    "taxBurden": 15500,
    "percentNewConstruction": 75
  },
  {
    "zip": "75034",
    "city": "Frisco",
    "isd": "Frisco ISD",
    "medianHomePrice": 650000,
    "medianSalePrice": 645000,
    "rentMedian": 3000,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 93,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 1,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.8,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 38,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Frisco Parks Dept"],
    "localExplanation": "75034 is what happens when the suburbs hit prestige mode. It's Frisco — but elevated. More polished, more refined, more \"my dry cleaner knows me by name.\" The Star is the unofficial town square and gives the area an upscale, electric energy.\n\nResidents are affluent, professional, and polished — but approachable. Lots of \"director at X,\" \"engineer at Y,\" \"VP at Z.\" People who demand convenience but also appreciate quality.\n\nFrisco ISD feeders here are elite. Parents literally move houses to stay in certain zones. Academic + extracurricular culture hits a sweet, high-performing balance.\n\nHomes are larger, more architecturally interesting, with golf-course communities and gated pockets sprinkled around. Three-car garages are standard. Backyards are well-kept. Everything is curated.\n\nLegacy West, The Star, Frisco Commons, and PGA Frisco access via short drives make this one of the most amenity-rich suburban pockets in Texas.\n\nTollway access makes north–south travel a breeze. East–west… less so.\n\nIf you want suburban luxury with the best of Frisco at your fingertips, 75034 hits like a perfectly timed stock option vest.",
    "restaurantUniqueCount": 85,
    "restaurantDiversityIndex": 0.85,
    "entertainmentCount": 25,
    "convenienceClusterScore": 95,
    "hasTownCenter": true,
    "taxBurden": 16250,
    "percentNewConstruction": 70
  },
  {
    "zip": "75013",
    "city": "Allen",
    "isd": "Allen ISD",
    "medianHomePrice": 520000,
    "medianSalePrice": 515000,
    "rentMedian": 2500,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 90,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 1,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.5,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 33,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Allen Parks & Recreation"],
    "localExplanation": "75013 is the mature, tree-lined suburb with quiet confidence. It doesn't try to impress you — it just *is* good. Calm streets, thoughtful urban planning, and neighborhoods that feel settled. The vibe is cozy, stable, and family-first.\n\nFamilies in 75013 tend to be thoughtful and steady — fewer flex cars, more community presence. People here want their kids to grow up in a grounded place with predictable routines and clean parks.\n\nAllen ISD is a powerhouse: high academic performance, huge extracurricular offerings, and a stadium that looks like a small college. Band is a big deal. STEM programs are excellent.\n\nHomes are well-built 2005–2015 constructions with space, trees, and cul-de-sacs. This is suburbia with character, not cookie-cutter boxes.\n\nWatters Creek is the lifestyle anchor — fountains, dining, weekend events. Twin Creeks adds golf and walkability.\n\nGreat 75 access means Plano and McKinney commutes are simple. Dallas is a tougher haul.\n\nIf you want a quieter, well-rounded suburb with excellent schools and a calm, mature feel — 75013 delivers every time.",
    "restaurantUniqueCount": 55,
    "restaurantDiversityIndex": 0.7,
    "entertainmentCount": 15,
    "convenienceClusterScore": 88,
    "hasTownCenter": true,
    "taxBurden": 13000,
    "percentNewConstruction": 45
  },
  {
    "zip": "75070",
    "city": "McKinney",
    "isd": "McKinney ISD",
    "medianHomePrice": 490000,
    "medianSalePrice": 485000,
    "rentMedian": 2300,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 85,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.9,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 40,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "McKinney Parks & Recreation"],
    "localExplanation": "75070 is the definition of \"pleasant suburb.\" It's calm, scenic, and deeply livable. A place where evening walks happen without planning and parks look like they were designed for postcards. This ZIP whispers, it doesn't shout.\n\nFamilies here want breathing room — a slower pace without sacrificing amenities. Lots of healthcare workers, engineers, educators, and stable professionals.\n\nMcKinney ISD in this area is solid and community-oriented. The academic culture is \"balanced excellence\" rather than pressure-cooker intensity.\n\nHousing ranges from mid-2000s builds to newer developments, many with ponds, trails, and stone-front architecture. Neighborhoods feel cared for.\n\nStonebridge Ranch, Gabe Nesbitt Park, and Towne Lake Park create an outstanding outdoor lifestyle. Runners and cyclists love this area.\n\n121 access is great. Downtown Dallas? Pack a lunch.\n\nIf you want a peaceful, beautiful suburb with strong community amenities, 75070 fits like a glove.",
    "restaurantUniqueCount": 40,
    "restaurantDiversityIndex": 0.65,
    "entertainmentCount": 10,
    "convenienceClusterScore": 80,
    "hasTownCenter": false,
    "taxBurden": 12250,
    "percentNewConstruction": 50
  },
  {
    "zip": "75072",
    "city": "McKinney",
    "isd": "McKinney ISD",
    "medianHomePrice": 540000,
    "medianSalePrice": 535000,
    "rentMedian": 2600,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 87,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.7,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 38,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "McKinney Parks & Recreation"],
    "localExplanation": "75072 feels like suburban serenity with a scenic twist. Stonebridge Ranch gives the area an almost resort-like vibe — lakes, trails, gorgeous landscaping, and that unmistakable \"we take pride in our neighborhood\" feeling.\n\nResidents skew upper-middle class, family-focused, and long-term. There's a sense of rootedness here. People don't move quickly — they settle.\n\nMcKinney ISD schools in this ZIP tend to be strong, structured, and very community-driven. Parents participate, but in a collaborative way.\n\nHomes here are tasteful, well-crafted, and framed by immaculate streets and mature trees. Adriatica Village adds a European flair you won't find anywhere else in DFW.\n\nStonebridge's network of trails, ponds, and recreational amenities is a lifestyle ecosystem of its own.\n\nGreat for Frisco or Allen commuters. Far for Dallas.\n\nIf you want scenic, peaceful, upscale suburbia — this is McKinney at its best.",
    "restaurantUniqueCount": 45,
    "restaurantDiversityIndex": 0.68,
    "entertainmentCount": 8,
    "convenienceClusterScore": 82,
    "hasTownCenter": true,
    "taxBurden": 13500,
    "percentNewConstruction": 40
  },
  {
    "zip": "75024",
    "city": "Plano West",
    "isd": "Plano ISD",
    "medianHomePrice": 580000,
    "medianSalePrice": 575000,
    "rentMedian": 2700,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 88,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.5,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 28,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "Plano Parks & Recreation"],
    "localExplanation": "75024 is Plano's flashy, urban-suburban hybrid. Corporate corridor by day, lively social hub by night. It's where suburban professionals go when they want city-style dining but still want to sleep in a quiet neighborhood.\n\nThe population is full of corporate climbers — Toyota, JPMorgan, Liberty Mutual, Frito-Lay. High income, high convenience expectations, zero nonsense.\n\nPlano ISD hits consistently high marks. Smart kids, solid teachers, rigorous but balanced culture.\n\nHousing is a mix: upscale single-family homes, townhomes for young professionals, and neighborhoods that feel mature and well-kept.\n\nLegacy West is the gravitational pull — sushi, steakhouses, ramen, bakery cafés, all within strolling distance. It's the closest thing Plano has to a downtown that actually buzzes.\n\nIf you work in Plano or Legacy West, your commute is elite. Dallas? Meh.\n\nFor families who want convenience, energy, and strong schools — 75024 is a winner.",
    "restaurantUniqueCount": 120,
    "restaurantDiversityIndex": 0.92,
    "entertainmentCount": 35,
    "convenienceClusterScore": 98,
    "hasTownCenter": true,
    "taxBurden": 14500,
    "percentNewConstruction": 30
  },
  {
    "zip": "75025",
    "city": "Plano",
    "isd": "Plano ISD",
    "medianHomePrice": 520000,
    "medianSalePrice": 515000,
    "rentMedian": 2400,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 86,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 1,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.0,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 30,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "Plano Parks & Recreation"],
    "localExplanation": "75025 is Plano at peak suburb: clean, organized, calm, and studded with parks. It's not flashy like 75024 or grand like 75093 — it's simply reliable and highly livable.\n\nResidents are professionals who value stability. Families who run tightly tuned schedules. People who take pride in good schools and good lawns.\n\nPlano ISD here is rock-solid — academic excellence without the burn-out culture.\n\nHomes are mostly 2000s builds with great layouts and mature landscapes. Neighborhoods feel safe and predictable.\n\nRussell Creek Park and Carpenter Rec Center anchor the area with trails, sports, and family activities.\n\nCommutes to anywhere in Plano are a breeze; 121 access is great.\n\nIf you want the definition of \"well-run suburb,\" this ZIP is it.",
    "restaurantUniqueCount": 35,
    "restaurantDiversityIndex": 0.75,
    "entertainmentCount": 10,
    "convenienceClusterScore": 75,
    "hasTownCenter": false,
    "taxBurden": 13000,
    "percentNewConstruction": 35
  },
  {
    "zip": "75093",
    "city": "Plano",
    "isd": "Plano ISD",
    "medianHomePrice": 670000,
    "medianSalePrice": 665000,
    "rentMedian": 3100,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 92,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 1,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.1,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 26,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "Plano Parks & Recreation"],
    "localExplanation": "75093 is Plano's upscale old guard — large homes, big trees, golf-course neighborhoods, and that quiet, refined confidence money can't fake. It's elegant without being gaudy.\n\nWho lives here? Professionals, executives, long-time Plano families, and people who appreciate mature neighborhoods that feel established rather than manufactured.\n\nPlano ISD excels here. High rigor, strong feeders, tons of AP/IB pipelines.\n\nHomes are spacious, custom-feeling, and beautifully maintained. Streets are wide and shaded, and the whole area feels premium.\n\nGleneagles Country Club, The Shops at Willow Bend, and easy Tollway access shape the lifestyle here.\n\nCommuting to DFW Airport, Las Colinas, or Irving is a dream.\n\nIf you want elite schools + beauty + convenience — Coppell is undefeated.",
    "restaurantUniqueCount": 65,
    "restaurantDiversityIndex": 0.8,
    "entertainmentCount": 15,
    "convenienceClusterScore": 90,
    "hasTownCenter": false,
    "taxBurden": 16750,
    "percentNewConstruction": 20
  },
  {
    "zip": "75078",
    "city": "Prosper",
    "isd": "Prosper ISD",
    "medianHomePrice": 700000,
    "medianSalePrice": 695000,
    "rentMedian": 3300,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 90,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 1,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.3,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 42,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "Town of Prosper"],
    "localExplanation": "75078 is suburban growth on steroids — new schools, giant homes, wide streets, and families who take youth sports VERY seriously. It's high-performing, high-energy, and high-sq-ft.\n\nFamilies moving from California LOVE Prosper: space, brand-new neighborhoods, and top-tier schools.\n\nProsper ISD is a rising star, known for academics, athletics, and huge student participation across programs.\n\nHomes here are big. Really big. Media rooms, game rooms, 3+ garages — Prosper doesn't do small.\n\nThe Gates of Prosper and endless new developments give you every convenience.\n\nCommutes to Frisco/Plano workers. Dallas? Bring a snack.\n\nIf you want big, new, and powerful school feeders — Prosper is your kingdom.",
    "restaurantUniqueCount": 30,
    "restaurantDiversityIndex": 0.6,
    "entertainmentCount": 5,
    "convenienceClusterScore": 70,
    "hasTownCenter": false,
    "taxBurden": 17500,
    "percentNewConstruction": 85
  },
  {
    "zip": "75009",
    "city": "Celina",
    "isd": "Celina ISD",
    "medianHomePrice": 550000,
    "medianSalePrice": 545000,
    "rentMedian": 2650,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 85,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.0,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 45,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Celina"],
    "localExplanation": "Celina is what Prosper was before the boom — charming, open, and brimming with potential. It's new developments across from cow pastures, families in golf carts, and Friday-night lights energy.\n\nFamilies here value space, community, and the feeling of getting in early on the next big thing.\n\nCelina ISD is rising fast — small enough to feel connected, strong enough to compete.\n\nHomes? Big lots, beautiful new builds, quiet streets. Less density, more breathing room.\n\nDowntown Celina has small-town charm with modern edges. Trails and fields for days.\n\nCommutes to Frisco/Prosper are simple. Dallas is a trek.\n\nIf you want frontier suburbia with major upside, Celina is the move.",
    "restaurantUniqueCount": 20,
    "restaurantDiversityIndex": 0.5,
    "entertainmentCount": 3,
    "convenienceClusterScore": 60,
    "hasTownCenter": true,
    "taxBurden": 13750,
    "percentNewConstruction": 90
  },
  {
    "zip": "76092",
    "city": "Southlake",
    "isd": "Carroll ISD",
    "medianHomePrice": 1100000,
    "medianSalePrice": 1095000,
    "rentMedian": 4500,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 100,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 1,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.8,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 30,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Southlake Parks & Recreation"],
    "localExplanation": "Southlake is Texas suburban royalty. Prestige suburbia. Excellence is the culture — schools, sports, safety, lifestyle — all of it. It's immaculate, leafy, and affluent as hell.\n\nExecutives, entrepreneurs, and high-income families dominate. Many chose Southlake for Carroll ISD specifically.\n\nCarroll ISD isn't just good — it's a dynasty. Elite academics + elite athletics + elite everything.\n\nHomes are estate-level: stone mansions, gates, acreage, architectural flexing everywhere.\n\nSouthlake Town Square is one of the best suburban retail districts in America. It's that good.\n\nCommutes to DFW Airport, Las Colinas, and Grapevine are phenomenal. Dallas is doable.\n\nIf you want prestige, space, safety, and generational school excellence — Southlake is the throne.",
    "restaurantUniqueCount": 75,
    "restaurantDiversityIndex": 0.82,
    "entertainmentCount": 18,
    "convenienceClusterScore": 96,
    "hasTownCenter": true,
    "taxBurden": 27500,
    "percentNewConstruction": 15
  },
  {
    "zip": "76034",
    "city": "Colleyville",
    "isd": "Grapevine-Colleyville ISD",
    "medianHomePrice": 850000,
    "medianSalePrice": 845000,
    "rentMedian": 3800,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 94,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 1,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.3,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 29,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Colleyville"],
    "localExplanation": "Colleyville is warm, refined, and community-centered. It's quieter than Southlake but just as lovely. Mature trees, big yards, space to breathe.\n\nResidents tend to be long-term and deeply invested in their neighborhoods. It's a place where people stay.\n\nGrapevine-Colleyville ISD is strong and consistently praised for academic quality and culture.\n\nHomes are large, traditional, and surrounded by beautiful landscaping. Streets feel private and peaceful.\n\nParks, local cafes, and proximity to Grapevine Lake round out the lifestyle.\n\nIf you want charm, safety, space, and a close-knit upper-middle-class suburb — Colleyville is top-tier.",
    "restaurantUniqueCount": 50,
    "restaurantDiversityIndex": 0.72,
    "entertainmentCount": 8,
    "convenienceClusterScore": 85,
    "hasTownCenter": false,
    "taxBurden": 21250,
    "percentNewConstruction": 10
  },
  {
    "zip": "75007",
    "city": "Carrollton",
    "isd": "Carrollton-Farmers Branch ISD",
    "medianHomePrice": 430000,
    "medianSalePrice": 425000,
    "rentMedian": 2100,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 78,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 3,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.8,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 32,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Carrollton Parks & Recreation"],
    "localExplanation": "75007 is the under-the-radar workhorse of North Dallas suburbs. Not flashy. Not hyped. Just incredibly convenient and surprisingly livable.\n\nFamilies here value location and affordability. Many work in Plano, Addison, Las Colinas, or Dallas — all within 20–25 minutes.\n\nCFB ISD is mixed, but the Rosemeade pockets have several strong elementary schools.\n\nHomes are classic 80s–2000s builds with character and mature trees. Sidewalks actually have shade.\n\nRosemeade Rec Center and Indian Creek Golf Club are the weekend staples.\n\nIf you want convenience without the price tags of Frisco/Plano/Coppell, 75007 is a quiet win.",
    "restaurantUniqueCount": 60,
    "restaurantDiversityIndex": 0.88,
    "entertainmentCount": 12,
    "convenienceClusterScore": 80,
    "hasTownCenter": true,
    "taxBurden": 10750,
    "percentNewConstruction": 5
  },
  {
    "zip": "75010",
    "city": "Carrollton",
    "isd": "Lewisville ISD",
    "medianHomePrice": 480000,
    "medianSalePrice": 475000,
    "rentMedian": 2250,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 80,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 3,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.6,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 29,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Carrollton Parks & Recreation"],
    "localExplanation": "75010 sits at a crossroads of convenience: part Carrollton, part Lewisville, with Castle Hills energy bleeding in. It's diverse, lively, and ridiculously well-located.\n\nResidents are young families, professionals, and people who want Frisco adjacency without Frisco pricing.\n\nLewisville ISD (especially Hebron feeders) is a huge selling point. Pockets of CFB ISD also serve the area.\n\nHousing ranges from newer townhomes to Castle Hills-adjacent premium builds to traditional suburban pockets.\n\nLifestyle perks include Grandscape, Arbor Hills, and every major highway within minutes.\n\nIf you want flexibility, affordability, and elite convenience — 75010 is a sleeper hit.",
    "restaurantUniqueCount": 70,
    "restaurantDiversityIndex": 0.9,
    "entertainmentCount": 20,
    "convenienceClusterScore": 92,
    "hasTownCenter": false,
    "taxBurden": 12000,
    "percentNewConstruction": 25
  },
  {
    "zip": "75019",
    "city": "Coppell",
    "isd": "Coppell ISD",
    "medianHomePrice": 620000,
    "medianSalePrice": 615000,
    "rentMedian": 2900,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 90,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 1,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.6,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 20,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Coppell Parks & Recreation"],
    "localExplanation": "75019 is the suburban gold standard: safe, clean, upscale, and extremely well-run. Everything feels intentional — the parks, the trails, the neighborhoods — like the city actually cares.\n\nFamilies here are high-income, highly involved, and passionate about Coppell ISD.\n\nCoppell ISD is consistently top-tier with strong academics, arts, and extracurriculars.\n\nHomes are well-kept, beautiful, and nestled among mature trees. Neighborhoods feel peaceful.\n\nAndy Brown Park, the Farmers Market, and endless trail networks define daily life.\n\nCommuting to DFW Airport, Las Colinas, or Irving is a dream.\n\nIf you want elite schools + beauty + convenience — Coppell is undefeated.",
    "restaurantUniqueCount": 45,
    "restaurantDiversityIndex": 0.7,
    "entertainmentCount": 10,
    "convenienceClusterScore": 85,
    "hasTownCenter": true,
    "taxBurden": 15500,
    "percentNewConstruction": 20
  },
  {
    "zip": "75052",
    "city": "Grand Prairie",
    "isd": "Grand Prairie ISD",
    "medianHomePrice": 380000,
    "medianSalePrice": 375000,
    "rentMedian": 1850,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 70,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 4,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.4,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 30,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "Grand Prairie Parks & Recreation"],
    "localExplanation": "75052 is vibrant, diverse, and full of activity. It's the \"fun suburb\" — packed with parks, entertainment venues, and family attractions. It's not trying to be fancy. It's trying to be enjoyable.\n\nResidents are families who want space, affordability, and central access to both Dallas and Fort Worth. Teachers, nurses, trades, airport employees — a true mix.\n\nGrand Prairie ISD is improving and offers standout specialty programs (STEM, fine arts, academies).\n\nHomes are affordable 90s–2010s builds with big yards and family-friendly streets.\n\nJoe Pool Lake, Epic Waters, Lynn Creek Park, and Traders Village anchor daily life. Kids LOVE living here.\n\nAs for commutes? You're dead center in the Metroplex — everything is 20–25 minutes away.\n\nIf you want affordability + convenience + family fun, 75052 over-delivers.",
    "restaurantUniqueCount": 55,
    "restaurantDiversityIndex": 0.85,
    "entertainmentCount": 18,
    "convenienceClusterScore": 78,
    "hasTownCenter": false,
    "taxBurden": 9500,
    "percentNewConstruction": 30
  },
  {
    "zip": "75080",
    "city": "Richardson",
    "isd": "Richardson ISD",
    "medianHomePrice": 450000,
    "medianSalePrice": 445000,
    "rentMedian": 2150,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 82,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.4,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 22,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "Richardson Parks & Recreation"],
    "localExplanation": "75080 is Richardson's established, tree-lined core — the OG inner-ring suburb that's been quietly excellent for decades. It's mature, diverse, and deeply convenient. No pretense, just strong bones.\n\nFamilies here value walkability, proximity to Dallas, and a multicultural vibe. The zip is packed with engineers from Texas Instruments, telecom pros, healthcare workers, and educators. It's blue-collar and white-collar shaking hands at Naan Stop.\n\nRichardson ISD is solid — not flashy, but respected. Schools emphasize academics, music, and arts. J.J. Pearce High School has a loyal following.\n\nHomes are mostly 70s–90s builds with character, space, and tree-lined streets. Neighborhoods like Canyon Creek and Heights Park feel established, walkable, and full of sidewalk life.\n\nGalatyn Park and CityLine inject urban energy — walkable dining, DART rail access, and weekend events. You can live suburban and ditch the car.\n\nCommuting anywhere in North Dallas is ridiculously easy: Plano, Addison, LBJ Freeway, George Bush Turnpike — it's all right there.\n\nIf you want central location + diversity + affordability + tree-lined streets, 75080 is the sleeper MVP of North Dallas.",
    "restaurantUniqueCount": 95,
    "restaurantDiversityIndex": 0.94,
    "entertainmentCount": 22,
    "convenienceClusterScore": 90,
    "hasTownCenter": true,
    "taxBurden": 11250,
    "percentNewConstruction": 5
  },
  {
    "zip": "75081",
    "city": "Richardson",
    "isd": "Richardson ISD",
    "medianHomePrice": 460000,
    "medianSalePrice": 455000,
    "rentMedian": 2200,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 80,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 3,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.1,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 24,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "Richardson Parks & Recreation"],
    "localExplanation": "75081 is the working-class heart of Richardson — affordable, diverse, and unpretentious. It doesn't flex. It just delivers: good location, decent schools, and real value.\n\nResidents are families looking for affordability without sacrificing access. Immigrant communities add cultural richness. There's authenticity here — small businesses, neighborhood barbecue joints, and families who stay for years.\n\nRichardson ISD serves the area with a focus on inclusivity and strong extracurriculars. Lake Highlands High School nearby has a huge following.\n\nHomes are 70s–80s ranch-style builds with big yards and quiet streets. They're not Pinterest-pretty, but they're solid and spacious.\n\nSpring Creek Nature Area, Heights Park, and easy access to CityLine keep families active.\n\nCommutes to Plano corporate campuses or Dallas are quick. LBJ and 75 access is excellent.\n\nIf you want affordability, diversity, and central convenience — 75081 is Richardson at its most real.",
    "restaurantUniqueCount": 70,
    "restaurantDiversityIndex": 0.92,
    "entertainmentCount": 15,
    "convenienceClusterScore": 82,
    "hasTownCenter": false,
    "taxBurden": 11500,
    "percentNewConstruction": 3
  },
  {
    "zip": "75082",
    "city": "Richardson",
    "isd": "Richardson ISD",
    "medianHomePrice": 470000,
    "medianSalePrice": 465000,
    "rentMedian": 2250,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 84,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.3,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 20,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "Richardson Parks & Recreation"],
    "localExplanation": "75082 is Richardson's \"up-and-coming\" ZIP — younger, trendier, and benefiting from CityLine's urban glow. It's the sweet spot between affordability and walkable lifestyle.\n\nFamilies here are urban-suburban hybrids: they want yards, but they also want to walk to brunch. Young professionals, dual-income families, and people who value diversity and convenience.\n\nRichardson ISD anchors the area with strong programs, and proximity to Plano and Garland ISDs means school choice options abound.\n\nHomes are a mix — 80s ranches getting flipped, newer townhomes near CityLine, and traditional neighborhoods with trees and charm.\n\nCityLine is the lifestyle magnet: DART rail, walkable dining, Alamo Drafthouse, weekend farmers markets. It's as close to urban living as suburbia gets.\n\nCommuting to anywhere in North Dallas or downtown is effortless. You're central to everything.\n\nIf you want affordability, walkability, diversity, and modern suburban energy — 75082 is Richardson's rising star.",
    "restaurantUniqueCount": 85,
    "restaurantDiversityIndex": 0.93,
    "entertainmentCount": 20,
    "convenienceClusterScore": 88,
    "hasTownCenter": true,
    "taxBurden": 11750,
    "percentNewConstruction": 15
  },
  {
    "zip": "75038",
    "city": "Irving",
    "isd": "Irving ISD",
    "medianHomePrice": 390000,
    "medianSalePrice": 385000,
    "rentMedian": 1950,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 72,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 3,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.7,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 18,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Irving Parks & Recreation"],
    "localExplanation": "75038 is Irving's most central, most connected, most \"everything-is-15-minutes-away\" ZIP code. It's diverse, affordable, and ridiculously convenient for commuters.\n\nResidents are working families, DFW Airport employees, Las Colinas professionals, and people who value location over prestige. Multicultural restaurants line every strip mall.\n\nIrving ISD is improving steadily, with strong magnet programs and career academies at MacArthur and Nimitz high schools. Families engaged in school choice find great options.\n\nHomes are 70s–90s builds with big yards and quiet streets. Not fancy, but spacious and affordable.\n\nLas Colinas Canal Walk, Toyota Music Factory, and DFW Airport proximity define the lifestyle.\n\nCommutes to anywhere in DFW are unbeatable: 10 minutes to Las Colinas, 15 to Dallas, 20 to Plano.\n\nIf you want affordability, diversity, and elite commute access — 75038 is a hidden gem.",
    "restaurantUniqueCount": 80,
    "restaurantDiversityIndex": 0.91,
    "entertainmentCount": 16,
    "convenienceClusterScore": 86,
    "hasTownCenter": false,
    "taxBurden": 9750,
    "percentNewConstruction": 8
  },
  {
    "zip": "75039",
    "city": "Irving",
    "isd": "Coppell ISD",
    "medianHomePrice": 410000,
    "medianSalePrice": 405000,
    "rentMedian": 2050,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 74,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.0,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 16,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Irving Parks & Recreation"],
    "localExplanation": "75039 is Irving's Las Colinas heart — sleek, modern, and business-district adjacent. It's where urban professionals live when they want to walk to work and skip the traffic.\n\nResidents are young professionals, corporate climbers, and dual-income families who prioritize convenience and lifestyle amenities.\n\nCoppell ISD feeders serve parts of this ZIP, a huge draw for families seeking top-tier schools while staying in Irving.\n\nHomes range from townhomes and condos near the canal to traditional single-family homes with mature trees.\n\nLas Colinas Urban Center, Canal Walk, and the Toyota Music Factory create a vibrant, walkable lifestyle.\n\nCommutes are elite: walk to work in Las Colinas, 10 minutes to DFW Airport, 15 to downtown Dallas.\n\nIf you want urban convenience with suburban pricing — 75039 is the move.",
    "restaurantUniqueCount": 90,
    "restaurantDiversityIndex": 0.89,
    "entertainmentCount": 24,
    "convenienceClusterScore": 94,
    "hasTownCenter": true,
    "taxBurden": 10250,
    "percentNewConstruction": 20
  },
  {
    "zip": "75062",
    "city": "Irving",
    "isd": "Irving ISD",
    "medianHomePrice": 400000,
    "medianSalePrice": 395000,
    "rentMedian": 2000,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 76,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.9,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 17,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Irving Parks & Recreation"],
    "localExplanation": "75062 is the family-friendly heart of Irving — parks, trails, and neighborhoods that actually feel like neighborhoods. It's quieter than 75038 and more established than 75039.\n\nFamilies here value affordability, diversity, and strong community ties. Lots of multigenerational households and long-term residents.\n\nIrving ISD schools in this ZIP tend to be solid, with strong community support and active PTAs. Nimitz High School is a point of pride.\n\nHomes are 80s–2000s builds with character, space, and tree-lined streets. It feels suburban without the suburban price tag.\n\nCampion Trails, Cimarron Park, and easy access to Las Colinas and DFW Airport make daily life convenient.\n\nCommutes to anywhere in DFW are simple: central location is the biggest selling point.\n\nIf you want affordability, space, and central convenience — 75062 delivers quietly.",
    "restaurantUniqueCount": 65,
    "restaurantDiversityIndex": 0.87,
    "entertainmentCount": 12,
    "convenienceClusterScore": 84,
    "hasTownCenter": false,
    "taxBurden": 10000,
    "percentNewConstruction": 12
  },
  {
    "zip": "75234",
    "city": "Farmers Branch",
    "isd": "Carrollton-Farmers Branch ISD",
    "medianHomePrice": 440000,
    "medianSalePrice": 435000,
    "rentMedian": 2100,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 79,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.2,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 20,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Farmers Branch Parks & Recreation"],
    "localExplanation": "75234 is Farmers Branch's walkable, urban-suburban core — tree-lined streets, parks on every corner, and DART rail access. It's the inner-ring suburb that didn't forget to be livable.\n\nResidents are young families, professionals, and people who value convenience and diversity. Strong immigrant communities add cultural richness.\n\nCarrollton-Farmers Branch ISD serves the area with solid elementary schools and strong community engagement.\n\nHomes are 70s–90s builds with character, mature trees, and sidewalks that actually get used. Neighborhoods feel walkable and connected.\n\nHistoric Downtown Farmers Branch, Farmers Branch Historical Park, and DART rail access to Dallas define the lifestyle.\n\nCommutes to Addison, Dallas, or Plano are all under 20 minutes.\n\nIf you want affordability, walkability, and central location — 75234 is a sleeper hit.",
    "restaurantUniqueCount": 70,
    "restaurantDiversityIndex": 0.86,
    "entertainmentCount": 14,
    "convenienceClusterScore": 87,
    "hasTownCenter": true,
    "taxBurden": 11000,
    "percentNewConstruction": 5
  },
  {
    "zip": "75244",
    "city": "Farmers Branch",
    "isd": "Carrollton-Farmers Branch ISD",
    "medianHomePrice": 460000,
    "medianSalePrice": 455000,
    "rentMedian": 2200,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 81,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 3.0,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 18,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Farmers Branch Parks & Recreation"],
    "localExplanation": "75244 is Farmers Branch's upscale pocket — larger homes, newer builds, and proximity to Addison's corporate corridor. It's the professional's choice for convenience without Plano pricing.\n\nResidents are dual-income families, corporate professionals, and people who want short commutes and strong schools.\n\nCarrollton-Farmers Branch ISD and Dallas ISD both serve parts of this ZIP, offering school choice flexibility.\n\nHomes are 90s–2010s builds with more space, better finishes, and well-maintained streets.\n\nAddison Circle, Vitruvian Park, and easy Tollway access create an urban-adjacent lifestyle.\n\nCommutes to Addison, Dallas, or Plano are all under 15 minutes.\n\nIf you want central location, strong schools, and affordability relative to Plano — 75244 is a smart move.",
    "restaurantUniqueCount": 75,
    "restaurantDiversityIndex": 0.84,
    "entertainmentCount": 16,
    "convenienceClusterScore": 89,
    "hasTownCenter": true,
    "taxBurden": 11500,
    "percentNewConstruction": 25
  },
  {
    "zip": "75067",
    "city": "Lewisville",
    "isd": "Lewisville ISD",
    "medianHomePrice": 420000,
    "medianSalePrice": 415000,
    "rentMedian": 2050,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 77,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 3,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.8,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 32,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Lewisville Parks & Recreation"],
    "localExplanation": "75067 is Lewisville's family-friendly core — parks, trails, Lewisville Lake, and neighborhoods that feel lived-in and welcoming. It's suburban without the suburban price tag.\n\nResidents are working families, educators, healthcare workers, and people who want affordability and space. Strong sense of community.\n\nLewisville ISD serves the area with solid schools and strong extracurricular programs. Families engaged in academics find great support.\n\nHomes are 80s–2000s builds with big yards, mature trees, and quiet streets. It's not flashy, but it's spacious and comfortable.\n\nLewisville Lake, MCL Grand Theater, and Railroad Park define weekend life.\n\nCommutes to Plano or Frisco are manageable. Dallas is a longer haul.\n\nIf you want affordability, lake access, and a strong sense of community — 75067 delivers.",
    "restaurantUniqueCount": 50,
    "restaurantDiversityIndex": 0.72,
    "entertainmentCount": 10,
    "convenienceClusterScore": 76,
    "hasTownCenter": true,
    "taxBurden": 10500,
    "percentNewConstruction": 10
  },
  {
    "zip": "75077",
    "city": "Lewisville",
    "isd": "Lewisville ISD",
    "medianHomePrice": 450000,
    "medianSalePrice": 445000,
    "rentMedian": 2150,
    "priceUpdatedAt": "2024-12",
    "schoolSignal": 80,
    "schoolUpdatedAt": "2024-11",
    "safetySignal": 2,
    "safetyUpdatedAt": "2024-10",
    "parksCountPerSqMi": 2.6,
    "parksUpdatedAt": "2024-09",
    "commuteTime": 30,
    "climate": "Warm",
    "sources": ["GreatSchools", "FBI Crime Statistics", "Zillow", "City of Lewisville Parks & Recreation"],
    "localExplanation": "75077 is Lewisville's newer, more polished side — Castle Hills adjacency, Hebron Parkway convenience, and neighborhoods that feel planned and modern.\n\nResidents are families who want newer homes, strong schools, and proximity to Frisco/Carrollton without the price tag.\n\nLewisville ISD (especially Hebron feeders) is a major draw. The schools are strong, and the community is invested.\n\nHomes are 2000s–2020s builds with modern layouts, good finishes, and neighborhood amenities.\n\nGrandscape, Lewisville Lake, and easy access to Plano/Frisco make the lifestyle convenient and fun.\n\nCommutes to Plano, Frisco, or Carrollton are quick. Dallas is farther.\n\nIf you want newer homes, strong schools, and great value — 75077 is Lewisville at its best.",
    "restaurantUniqueCount": 60,
    "restaurantDiversityIndex": 0.76,
    "entertainmentCount": 14,
    "convenienceClusterScore": 83,
    "hasTownCenter": false,
    "taxBurden": 11250,
    "percentNewConstruction": 60
  }
]
