{
  "75006": {
    "needs_nuance": false
  },
  "75007": {
    "needs_nuance": false
  },
  "75010": {
    "needs_nuance": true,
    "nuance_copy": "Heads up from Sofee: 75010 is a mash-up of Carrollton and The Colony. The voting data averages across those pockets, so it can look more middle-of-the-road on paper than specific neighborhoods might feel on the ground."
  },
  "75013": {
    "needs_nuance": false
  },
  "75019": {
    "needs_nuance": true,
    "nuance_copy": "Sofee note: Coppell sits in a tricky spot on the map, and the numbers blend different county patterns. The charts may look fairly balanced, but day-to-day Coppell often feels more like a traditional, school-centric conservative suburb."
  },
  "75024": {
    "needs_nuance": false
  },
  "75025": {
    "needs_nuance": false
  },
  "75034": {
    "needs_nuance": true,
    "nuance_copy": "Little nuance for you: west Frisco pulls in a lot of corporate transplants, but it's still anchored by pretty traditional, high-end suburban neighborhoods. The county-level voting data smooths that out a bit, so it may look more mixed on the chart than it feels at the cul-de-sac level."
  },
  "75035": {
    "needs_nuance": false
  },
  "75067": {
    "needs_nuance": false
  },
  "75070": {
    "needs_nuance": false
  },
  "75072": {
    "needs_nuance": true,
    "nuance_copy": "Sofee context: west McKinney/Stonebridge pulls in both newer, more moderate families and long-time, more traditional homeowners. The voting math lands near the middle, but some pockets feel noticeably more conservative than the overall ZIP suggests."
  },
  "75071": {
    "needs_nuance": false
  },
  "75068": {
    "needs_nuance": false
  },
  "75075": {
    "needs_nuance": false
  },
  "75074": {
    "needs_nuance": false
  },
  "75093": {
    "needs_nuance": false
  },
  "75094": {
    "needs_nuance": false
  },
  "75028": {
    "needs_nuance": false
  },
  "75056": {
    "needs_nuance": true,
    "nuance_copy": "Quick reality check from Sofee: 75056 mixes upscale Castle Hills with more mixed and evolving parts of The Colony. The charts are averaging all of that together, so one street can feel country-club conservative while another feels more middle-of-the-road."
  },
  "75078": {
    "needs_nuance": true,
    "nuance_copy": "Sofee honesty: the voting data for Prosper/Celina already leans red, but day-to-day the culture often feels even more traditionally conservative than the percentages show—lots of new builds, big yards, and church-centric community life."
  },
  "75077": {
    "needs_nuance": true,
    "nuance_copy": "Nuance alert: 75077 stretches from Highland Village into north Lewisville. The numbers blend those worlds, so the ZIP looks more balanced overall while certain pockets (especially around the lake and established neighborhoods) feel more classically conservative."
  },
  "75080": {
    "needs_nuance": false
  },
  "75081": {
    "needs_nuance": false
  },
  "75082": {
    "needs_nuance": false
  },
  "75002": {
    "needs_nuance": true,
    "nuance_copy": "Sofee context: east Allen has a solid suburban, slightly conservative feel, but it's also changing as more families move in from all over DFW. The election charts capture that shift as 'more mixed,' so don't be surprised if older parts of 75002 feel a bit more traditional than the graph implies."
  },
  "76034": {
    "needs_nuance": true,
    "nuance_copy": "Tiny caveat from Sofee: Colleyville's voting data can trend toward mixed when you blend it with nearby areas, but the lived reputation is pretty clearly affluent and conservative. Think big yards, church on Sunday, and long-time residents who've been here for decades."
  },
  "76092": {
    "needs_nuance": true,
    "nuance_copy": "Southlake reality check: the ZIP-level voting math blends Tarrant and Denton counties and ends up looking more 'mixed.' But if you ask families, Southlake itself is widely experienced as a very conservative, high-expectation suburb—especially around schools and local politics."
  },
  "75038": {
    "needs_nuance": false
  },
  "75039": {
    "needs_nuance": false
  },
  "75052": {
    "needs_nuance": false
  },
  "75062": {
    "needs_nuance": false
  },
  "75234": {
    "needs_nuance": false
  },
  "75244": {
    "needs_nuance": false
  },
  "75009": {
    "needs_nuance": false
  }
}
